ucm-scout/case_template/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
location   system;
object     controlDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

libs ("libABLBC.so");

application unsteadyThermalFoam;

startFrom latestTime;

startTime 0;

stopAt endTime;

endTime ###END_TIME###;

deltaT 600;

writeControl adjustableRunTime;

writeInterval 600;

purgeWrite 0;

writeFormat ascii;

writePrecision 6;

writeCompression on;

timeFormat general;

timePrecision 10;

runTimeModifiable true;

DebugSwitches
{
dimensionSet 0;
}
// ************************************************************************* // 

