ucm-scout/case_template/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     blockMeshDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

scale 1.0;

vertices
(
(###X_MIN### ###Y_MIN### ###Z_MIN###)
(###X_MAX### ###Y_MIN### ###Z_MIN###)
(###X_MAX### ###Y_MAX### ###Z_MIN###)
(###X_MIN### ###Y_MAX### ###Z_MIN###)
(###X_MIN### ###Y_MIN### ###Z_MAX###)
(###X_MAX### ###Y_MIN### ###Z_MAX###)
(###X_MAX### ###Y_MAX### ###Z_MAX###)
(###X_MIN### ###Y_MAX### ###Z_MAX###)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (355 355 116) simpleGrading 
(
(
( 0.423810 0.200000 0.034899)
( 0.160000 0.600000 1.000000)
( 0.423810 0.200000 28.653791)
)
(
( 0.423810 0.200000 0.034899)
( 0.160000 0.600000 1.000000)
( 0.423810 0.200000 28.653791)
)
(
( 0.167191 0.800000 1.000000)
( 0.832809 0.200000 91.583400)
)
)
);
edges
(
);


boundary
(
lower
{
type wall;
faces
(
(0 3 2 1)
);
}
upper
{
type patch;
faces
(
(4 5 6 7)
);
}
west
{
type patch;
neighbourPatch east;
faces
(
(0 4 7 3)
);
}
east
{
type patch;
neighbourPatch west;
faces
(
(1 2 6 5)
);
}
north
{
type patch;
neighbourPatch south;
faces
(
(3 7 6 2)
);
}
south
{
type patch;
neighbourPatch north;
faces
(
(0 1 5 4)
);
}
);



mergePatchPairs
(
);

// ************************************************************************* // 

