ucm-scout/case_template/constant/ABLDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
location   constant;
object     ABLDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

z0 0.05;
ZRef 5;
TZRef 5;
mAvail 0.1;
profileSize 32;
solverType unsteadyHumid;
fullSolver true;
hotSpot false;
callRadiation 50;
Nudge true; 
xWest ###WEST###;
xEast ###EAST###;
ySouth ###SOUTH###;
yNorth ###NORTH###;
zLower ###LOWER###;
zUpper ###UPPER###;
xCoeff 0.43833641097346876;
yCoeff 0.43833641097346876;
zCoeff 0.13714275747992313;
profileTable
(
(-43200 -0.560659 1.45603 299.346 0.017297 90.7299 212.494 1e+07 -3.53258 7.66405 300.562 0.016241)
(-39600 -0.306143 1.11263 299.115 0.0174644 36.1428 282.493 1e+07 -3.29563 7.47787 300.561 0.0160962)
(-36000 -0.180018 1.00935 298.819 0.0178398 23.6584 32.4992 1e+07 -0.848788 3.52357 299.83 0.0174624)
(-32400 -0.246094 1.1164 298.602 0.0179768 32.6239 152.496 1e+07 -2.03276 6.2574 300.048 0.01718)
(-28800 -0.293147 1.19959 298.536 0.0180378 40.356 212.494 1e+07 -2.70925 7.52949 300.198 0.017047)
(-25200 -0.379832 1.24534 298.559 0.0183702 46.0755 212.494 1e+07 -2.99905 7.65615 300.066 0.0176112)
(-21600 -0.400846 1.33275 298.634 0.0184005 58.0841 212.494 1e+07 -3.18321 7.81315 300.105 0.0172412)
(-18000 -0.567792 1.46502 298.734 0.0181935 77.7198 282.493 1e+07 -3.54032 8.99813 300.135 0.0169759)
(-14400 -0.929441 1.83153 299.346 0.0183331 322.299 282.493 1e+07 -3.83747 8.68462 300.023 0.0175048)
(-12600 -1.06348 2.11479 299.766 0.0182776 -100000 322.492 1e+07 -3.68883 8.75782 300.111 0.0174497)
(-10800 -1.19751 2.39805 300.187 0.0182221 -568.54 362.491 1e+07 -3.54019 8.83103 300.198 0.0173945)
(-7200 -0.955058 2.43386 300.962 0.0180095 -162.633 662.483 1e+07 -1.26838 9.59752 300.867 0.0163382)
(-3600 -0.764021 2.55195 301.72 0.0176526 -99.6247 662.483 1e+07 -1.42139 8.90823 301.029 0.0159743)
(0 -0.774491 2.27274 302.929 0.0172012 -56.0158 782.48 1e+07 -1.1071 7.88712 301.512 0.016014)
(3600 0.0347955 1.43078 303.777 0.0170732 -19.9056 1362.46 1e+07 1.96337 6.54948 303.801 0.0136901)
(7200 -2.29436 2.07964 302.509 0.017958 -102.585 452.488 1e+07 1.22784 6.84387 302.564 0.0166333)
(10800 -0.434666 2.45545 304.637 0.0151976 -44.5227 1052.47 1e+07 -0.089581 7.23416 302.879 0.0152808)
(14400 -1.15408 1.58893 303.516 0.0172612 -61.3988 1052.47 1e+07 0.0761389 5.87366 303.136 0.0147131)
(18000 -2.42525 2.43848 302.747 0.0171047 -203.695 782.48 1e+07 0.601782 8.3021 302.539 0.0165872)
(21600 -2.00854 2.32525 301.949 0.0169437 -381.104 452.488 1e+07 -3.16873 7.77376 301.788 0.016804)
(25200 -1.78194 2.26594 301.199 0.0172172 -52289.8 452.488 1e+07 -4.00756 7.96859 301.277 0.0166184)
(27000 -1.75894 2.17136 300.95 0.0174531 -100000 407.489 1e+07 -4.6715 7.79124 301.048 0.0169795)
(28800 -1.73594 2.07678 300.702 0.017689 1195.95 362.491 1e+07 -5.33543 7.61388 300.819 0.0173406)
);
cCRSProfileSize 22;
cCRSStartTime 12;
cCRSProfileTableU
(
(4.99987 -0.560659 -0.306143  -0.180018  -0.246094  -0.293147  -0.379832  -0.400846  -0.567792  -0.929441  -1.19751  -0.955058  -0.764021  -0.774491  0.0347955  -2.29436  -0.434666  -1.15408  -2.42525  -2.00854  -1.78194  -1.73594 )
(19.9995 -1.23981 -0.759574  -0.50941  -0.655522  -0.728718  -0.9046  -0.979404  -1.25147  -1.87055  -2.29953  -1.81539  -1.45351  -1.49709  0.229925  -4.50855  -0.827222  -2.21797  -4.51254  -3.76623  -3.41725  -3.35192 )
(44.9988 -1.80411 -1.18358  -0.848788  -1.0426  -1.1188  -1.37206  -1.51517  -1.81334  -2.48351  -2.81027  -2.16351  -1.72047  -1.7638  0.213902  -5.38563  -0.964849  -2.45176  -5.33834  -4.50502  -4.2397  -4.22148 )
(79.9979 -2.20447 -1.51267  -0.848788  -1.34574  -1.43423  -1.73667  -1.92109  -2.21257  -2.93439  -3.13521  -2.37166  -1.88603  -1.89718  0.0537423  -5.67422  -0.954689  -2.17164  -5.75917  -4.90799  -4.75402  -4.78877 )
(124.997 -2.52978 -1.82024  -0.848788  -1.65419  -1.76906  -2.0829  -2.28401  -2.53953  -3.29654  -3.37123  -2.51583  -2.00901  -1.97259  -0.145662  -5.57011  -0.868552  -1.67268  -5.94691  -5.12666  -5.07332  -5.14401 )
(179.995 -2.92759 -2.20501  -0.848788  -2.03276  -2.20038  -2.498  -2.69679  -2.88563  -3.64341  -3.5599  -2.62758  -2.11449  -2.01111  -0.322857  -4.94468  -0.738151  -1.07661  -5.96117  -5.221  -5.25582  -5.34955 )
(244.994 -3.53258 -2.75879  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.30603  -3.96417  -3.71482  -2.71987  -2.21271  -2.01972  -0.44689  -3.54746  -0.574179  -0.467662  -5.80458  -5.2128  -5.34565  -5.48068 )
(319.992 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.80742  -2.7948  -2.30512  -2.00234  -0.521964  -1.53101  -0.379608  0.0279222  -5.46992  -4.92467  -5.34929  -5.56323 )
(404.99 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -2.84525  -2.38745  -1.96335  -0.585769  0.339374  -0.161411  0.281501  -5.01432  -4.07052  -5.01954  -5.33543 )
(499.987 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -2.855  -2.45072  -1.90801  -0.68098  1.22784  0.059164  0.309229  -4.49558  -3.16873  -4.00756  -5.33543 )
(604.984 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -2.38324  -2.24959  -1.85017  -0.833433  1.22784  0.247722  0.261461  -3.45535  -3.16873  -4.00756  -5.33543 )
(719.981 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.67798  -1.04831  1.22784  0.372143  0.24007  -1.35694  -3.16873  -4.00756  -5.33543 )
(844.978 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  -1.2545  1.22784  0.449416  0.235948  0.601782  -3.16873  -4.00756  -5.33543 )
(979.974 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  -1.36054  1.22784  0.15799  0.247216  0.601782  -3.16873  -4.00756  -5.33543 )
(1124.97 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  -1.35811  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(1279.97 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  -0.57547  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(1444.96 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(1619.96 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(1804.95 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(1999.95 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(2204.95 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
(2419.94 -3.53258 -3.29563  -0.848788  -2.03276  -2.70925  -2.99905  -3.18321  -3.54032  -3.83747  -3.54019  -1.26838  -1.42139  -1.1071  1.96337  1.22784  -0.089581  0.0761389  0.601782  -3.16873  -4.00756  -5.33543 )
);
cCRSProfileTableV
(
(4.99987 1.45603 1.11263  1.00935  1.1164  1.19959  1.24534  1.33275  1.46502  1.83153  2.39805  2.43386  2.55195  2.27274  1.43078  2.07964  2.45545  1.58893  2.43848  2.32525  2.26594  2.07678 )
(19.9995 3.11166 2.52353  2.36062  2.58354  2.75536  2.81431  2.94118  3.16824  3.67063  4.65061  4.6973  4.89764  4.38526  2.95381  3.87127  4.76275  3.21584  4.72045  4.50913  4.43715  4.08959 )
(44.9988 4.44241 3.77446  3.52357  3.8465  4.08165  4.16896  4.28724  4.56366  4.79858  5.68867  5.63512  5.79194  5.18025  3.71322  4.59132  5.65525  4.00446  5.74011  5.52591  5.55638  5.18348 )
(79.9979 5.42791 4.68421  3.52357  4.74149  5.00963  5.1448  5.26234  5.6161  5.60701  6.33174  6.20058  6.31264  5.59557  4.09767  5.0063  6.05319  4.46926  6.3598  6.16781  6.27125  5.89985 )
(124.997 6.17165 5.38721  3.52357  5.49318  5.79578  5.94464  6.06438  6.47005  6.27072  6.78938  6.60768  6.67585  5.88777  4.35225  5.36429  6.28608  4.83763  6.79467  6.62271  6.74049  6.36434 )
(179.995 6.89399 6.08557  3.52357  6.2574  6.63902  6.77583  6.90243  7.32173  6.96829  7.15997  6.9487  6.96773  6.13371  4.55738  5.82054  6.45081  5.18688  7.12704  6.97027  7.05899  6.67218 )
(244.994 7.66405 6.8128  3.52357  6.2574  7.52949  7.65615  7.81315  8.23958  7.8404  7.50171  7.27063  7.22821  6.36483  4.73856  6.34513  6.58325  5.54043  7.40358  7.23764  7.3043  6.92546 )
(319.992 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.12841  7.60161  7.4773  6.59489  4.90487  6.68587  6.69905  5.87018  7.64044  7.54639  7.50532  7.14354 )
(404.99 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  7.96562  7.72356  6.82342  5.06589  6.79485  6.80257  6.11594  7.83114  7.79747  7.76727  7.61388 )
(499.987 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  8.41883  7.94373  7.03516  5.24886  6.84387  6.88768  6.2522  7.99745  7.77376  7.96859  7.61388 )
(604.984 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.25667  8.42704  7.19893  5.49691  6.84387  6.93494  6.29352  8.18974  7.77376  7.96859  7.61388 )
(719.981 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.38498  5.83007  6.84387  6.91568  6.23987  8.34798  7.77376  7.96859  7.61388 )
(844.978 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.18346  6.84387  6.83197  6.10438  8.3021  7.77376  7.96859  7.61388 )
(979.974 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.43774  6.84387  6.96695  5.85605  8.3021  7.77376  7.96859  7.61388 )
(1124.97 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.56032  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(1279.97 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.69096  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(1444.96 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(1619.96 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(1804.95 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(1999.95 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(2204.95 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
(2419.94 7.66405 7.47787  3.52357  6.2574  7.52949  7.65615  7.81315  8.99813  8.68462  8.83103  9.59752  8.90823  7.88712  6.54948  6.84387  7.23416  5.87366  8.3021  7.77376  7.96859  7.61388 )
);
cCRSProfileTableT
(
(4.99987 299.346 299.115  298.819  298.602  298.536  298.559  298.634  298.734  299.346  300.187  300.962  301.72  302.929  303.777  302.509  304.637  303.516  302.747  301.949  301.199  300.702 )
(19.9995 299.793 299.674  299.513  299.35  299.277  299.212  299.223  299.239  299.525  300.105  300.734  301.362  302.443  303.262  302.039  304.198  303.094  302.437  301.804  301.215  300.772 )
(44.9988 300.085 299.971  299.83  299.695  299.644  299.568  299.555  299.53  299.63  300.059  300.609  301.173  302.179  302.957  301.793  303.93  302.909  302.275  301.726  301.226  300.817 )
(79.9979 300.226 300.087  299.83  299.82  299.769  299.701  299.691  299.662  299.684  300.029  300.527  301.05  302.004  302.757  301.652  303.743  302.84  302.176  301.678  301.23  300.842 )
(124.997 300.3 300.153  299.83  299.924  299.869  299.791  299.789  299.742  299.718  300.008  300.466  300.959  301.873  302.614  301.579  303.6  302.842  302.11  301.645  301.228  300.847 )
(179.995 300.387 300.231  299.83  300.048  299.997  299.898  299.91  299.829  299.761  299.993  300.417  300.886  301.766  302.51  301.543  303.48  302.912  302.064  301.62  301.222  300.843 )
(244.994 300.562 300.358  299.83  300.048  300.198  300.066  300.105  299.956  299.843  299.987  300.376  300.825  301.673  302.439  301.679  303.371  303.049  302.034  301.601  301.215  300.836 )
(319.992 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  299.999  300.343  300.774  301.591  302.394  301.962  303.27  303.227  302.017  301.585  301.208  300.828 )
(404.99 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.319  300.734  301.517  302.371  302.266  303.178  303.308  301.992  301.63  301.206  300.819 )
(499.987 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.311  300.705  301.452  302.361  302.564  303.094  303.301  301.947  301.788  301.277  300.819 )
(604.984 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.359  300.681  301.396  302.356  302.564  303.014  303.254  301.881  301.788  301.277  300.819 )
(719.981 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.345  302.355  302.564  302.937  303.188  302.048  301.788  301.277  300.819 )
(844.978 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  302.384  302.564  302.869  303.12  302.539  301.788  301.277  300.819 )
(979.974 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  302.463  302.564  302.768  303.043  302.539  301.788  301.277  300.819 )
(1124.97 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  302.727  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(1279.97 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.077  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(1444.96 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(1619.96 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(1804.95 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(1999.95 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(2204.95 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
(2419.94 300.562 300.561  299.83  300.048  300.198  300.066  300.105  300.135  300.023  300.198  300.867  301.029  301.512  303.801  302.564  302.879  303.136  302.539  301.788  301.277  300.819 )
);
cCRSProfileTableq
(
(4.99987 0.017297 0.0174644  0.0178398  0.0179768  0.0180378  0.0183702  0.0184005  0.0181935  0.0183331  0.0182221  0.0180095  0.0176526  0.0172012  0.0170732  0.017958  0.0151976  0.0172612  0.0171047  0.0169437  0.0172172  0.017689 )
(19.9995 0.0171577 0.0172803  0.0176204  0.0177904  0.0178968  0.0182804  0.0183024  0.0180982  0.018269  0.0181775  0.0179589  0.0175963  0.0171416  0.0170307  0.0179297  0.0151038  0.0171457  0.0170524  0.0168881  0.0171571  0.0176378 )
(44.9988 0.0170206 0.017147  0.0174624  0.0176274  0.0177656  0.0181841  0.0181816  0.0179963  0.0182143  0.0181463  0.0179268  0.0175619  0.0171081  0.0170033  0.0179142  0.0150539  0.0170182  0.0170185  0.0168525  0.0171064  0.0175899 )
(79.9979 0.0168798 0.0170392  0.0174624  0.0174986  0.0176636  0.0180973  0.0180521  0.0178871  0.0181566  0.0181166  0.0178997  0.0175336  0.0170845  0.0169803  0.0178976  0.0150295  0.01687  0.0169902  0.0168236  0.0170552  0.017537 )
(124.997 0.0167565 0.0169449  0.0174624  0.017378  0.0175706  0.0180189  0.0179089  0.017775  0.0180909  0.0180835  0.0178724  0.0175059  0.0170639  0.0169551  0.0178636  0.0150137  0.0166841  0.0169639  0.0167978  0.0170066  0.0174903 )
(179.995 0.0165899 0.0168048  0.0174624  0.01718  0.0174108  0.0178953  0.0176826  0.0176256  0.0180025  0.0180426  0.0178413  0.0174745  0.0170432  0.0169229  0.0178498  0.0150017  0.0164278  0.0169385  0.0167749  0.0169608  0.0174551 )
(244.994 0.016241 0.0165266  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0173633  0.0178373  0.0179867  0.0178029  0.0174362  0.0170205  0.0168781  0.0178969  0.0149959  0.0160846  0.0169158  0.0167573  0.016914  0.0174226 )
(319.992 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0178638  0.0177527  0.0173872  0.0169944  0.0168224  0.0177396  0.0149979  0.0156643  0.0169081  0.0167439  0.016864  0.0173893 )
(404.99 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0176823  0.0173246  0.0169645  0.0167544  0.0173306  0.015004  0.0153519  0.0169482  0.0167347  0.0167809  0.0173406 )
(499.987 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0175659  0.017251  0.0169308  0.0166786  0.0166333  0.0150088  0.0151735  0.0170237  0.016804  0.0166184  0.0173406 )
(604.984 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0172256  0.0171252  0.0168946  0.0166162  0.0166333  0.0150101  0.0150722  0.017146  0.016804  0.0166184  0.0173406 )
(719.981 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.01684  0.0166274  0.0166333  0.0150073  0.014991  0.0171339  0.016804  0.0166184  0.0173406 )
(844.978 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0166708  0.0166333  0.0150028  0.0149174  0.0165872  0.016804  0.0166184  0.0173406 )
(979.974 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.016505  0.0166333  0.0149996  0.0148417  0.0165872  0.016804  0.0166184  0.0173406 )
(1124.97 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0159303  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(1279.97 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0150867  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(1444.96 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(1619.96 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(1804.95 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(1999.95 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(2204.95 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
(2419.94 0.016241 0.0160962  0.0174624  0.01718  0.017047  0.0176112  0.0172412  0.0169759  0.0175048  0.0173945  0.0163382  0.0159743  0.016014  0.0136901  0.0166333  0.0152808  0.0147131  0.0165872  0.016804  0.0166184  0.0173406 )
);