ucm-scout/case_template/0/U
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class      volVectorField;
location   0;
object     U;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

dimensions	  [0 1 -1 0 0 0 0];

internalField	  uniform (-1.063477635383606 2.11479115486145 0);

boundaryField
	{
	 "procBoundary.*" 
	 	 { 
	 	 	 type processor;
	 	}
	 west 
 	 	 { 
	 	 	 type unsteadyABLInflowU;
	 	 	 ZRef 5.0;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 east 
 	 	 { 
	 	 	 type unsteadyABLInflowU;
	 	 	 ZRef 5.0;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 north 
 	 	 { 
	 	 	 type unsteadyABLInflowU;
	 	 	 ZRef 5.0;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 south 
 	 	 { 
	 	 	 type unsteadyABLInflowU;
	 	 	 ZRef 5.0;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 upper 
 	 	 { 
	 	 	 type unsteadyABLInflowU;
	 	 	 ZRef 5.0;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 nonstl 
 	 	 { 
	 	 	 type ABLMOWallU;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 ###STL_NAME### 
 	 	 { 
	 	 	 type ABLLouisWallU;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 lower 
 	 	 { 
	 	 	 type ABLLouisWallU;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	 bufferstl 
 	 	 { 
	 	 	 type ABLLouisWallU;
	 	 	 z0 0.05;
	 	 	 value uniform ( -1.063477635383606  2.11479115486145 0);
;
	 	 }
	}
