ucm-scout/case_template/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class      volScalarField;
location   0;
object     p_rgh;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

dimensions	  [0 0 0 0 0 0 0];

internalField	  uniform 0.0;

boundaryField
	{
	 "procBoundary.*" 
	 	 { 
	 	 	 type processor;
	 	}
	 west 
 	 	 { 
	 	 	 type pressureBC;
	 	 	 freestreamValue uniform 0;
	 	 	 value uniform 0.0;
	 	 }
	 east 
 	 	 { 
	 	 	 type pressureBC;
	 	 	 freestreamValue uniform 0;
	 	 	 value uniform 0.0;
	 	 }
	 north 
 	 	 { 
	 	 	 type pressureBC;
	 	 	 freestreamValue uniform 0;
	 	 	 value uniform 0.0;
	 	 }
	 south 
 	 	 { 
	 	 	 type pressureBC;
	 	 	 freestreamValue uniform 0;
	 	 	 value uniform 0.0;
	 	 }
	 upper 
 	 	 { 
	 	 	 type pressureBC;
	 	 	 freestreamValue uniform 0;
	 	 	 value uniform 0.0;
	 	 }
	 nonstl 
 	 	 { 
	 	 	 type fixedFluxPressure;
	 	 	 rho rhok;
	 	 	 value uniform 0.0;
	 	 }
	 ###STL_NAME### 
 	 	 { 
	 	 	 type fixedFluxPressure;
	 	 	 rho rhok;
	 	 	 value uniform 0.0;
	 	 }
	 lower 
 	 	 { 
	 	 	 type fixedFluxPressure;
	 	 	 rho rhok;
	 	 	 value uniform 0.0;
	 	 }
	 bufferstl 
 	 	 { 
	 	 	 type fixedFluxPressure;
	 	 	 rho rhok;
	 	 	 value uniform 0.0;
	 	 }
	}
