ucm-scout/case_template/0/T
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class      volScalarField;
location   0;
object     T;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

dimensions	  [0 0 0 1 0 0 0];

internalField	  uniform 299.76641845703125;

boundaryField
	{
	 "procBoundary.*" 
	 	 { 
	 	 	 type processor;
	 	}
	 west 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 east 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 north 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 south 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 upper 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 nonstl 
 	 	 { 
	 	 	 type unsteadyABLInflowT;
	 	 	 z0 0.05;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 ###STL_NAME### 
 	 	 { 
	 	 	 type ABLLouisWallT;
	 	 	 z0 0.05;
	 	 	 mavail 0.1;
	 	 	 matDensity (2400 2400 2400 2400);
	 	 	 specificHeat (1000 1000 1000 1000);
	 	 	 thermalCon (1.3 1.3 1.3 1.3);
	 	 	 thickness (0.1 0.2 0.3 0.4);
	 	 	 sensibleHeat uniform 0.0;
	 	 	 Tw uniform 299.76641845703125;
	 	 	 T1 uniform 298.8832092285156;
	 	 	 T2 uniform 298.4416046142578;
	 	 	 T3 uniform 298.2208023071289;
	 	 	 T4 uniform 298.11040115356445;
	 	 	 Tdeep uniform 298.0;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 lower 
 	 	 { 
	 	 	 type ABLLouisWallT;
	 	 	 z0 0.05;
	 	 	 mavail 0.1;
	 	 	 matDensity (2000.0 2000.0 2000.0 2000.0);
	 	 	 specificHeat (1000.0 1000.0 1000.0 1000.0);
	 	 	 thermalCon (1.8 1.8 1.8 1.8);
	 	 	 thickness (0.010000000000000002 0.020000000000000004 0.03 0.04000000000000001);
	 	 	 sensibleHeat uniform 0.0;
	 	 	 Tw uniform 299.76641845703125;
	 	 	 T1 uniform 298.9582092285156;
	 	 	 T2 uniform 298.55410461425777;
	 	 	 T3 uniform 298.3520523071289;
	 	 	 T4 uniform 298.25102615356445;
	 	 	 Tdeep uniform 298.15;
	 	 	 value uniform 299.76641845703125;
	 	 }
	 bufferstl 
 	 	 { 
	 	 	 type ABLLouisWallT;
	 	 	 z0 0.05;
	 	 	 mavail 0.1;
	 	 	 matDensity (2000.0 2000.0 2000.0 2000.0);
	 	 	 specificHeat (1000.0 1000.0 1000.0 1000.0);
	 	 	 thermalCon (1.8 1.8 1.8 1.8);
	 	 	 thickness (0.010000000000000002 0.020000000000000004 0.03 0.04000000000000001);
	 	 	 sensibleHeat uniform 0.0;
	 	 	 Tw uniform 299.76641845703125;
	 	 	 T1 uniform 298.9582092285156;
	 	 	 T2 uniform 298.55410461425777;
	 	 	 T3 uniform 298.3520523071289;
	 	 	 T4 uniform 298.25102615356445;
	 	 	 Tdeep uniform 298.15;
	 	 	 value uniform 299.76641845703125;
	 	 }
	}
