ucm-scout/case_template/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v1812                                |
|   \  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       dictionary;
object     topoSetDict;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 

actions
(
{name lowerFaces;
type faceSet;
action new;
source patchToFace;
sourceInfo
{
patch "lower";
}
}{
name	 lowerCells;
type cellSet;
action new;
source boxToCell;
sourceInfo
{
box (39994.925000 31994.925000 0.000000) (40208.075000 32208.075000 300.000000);
}
}
{
name stlFaces;
type faceSet;
action new;
source cellToFace;
sourceInfo
{
set lowerCells;
option all;
}
}
{
name bufferstlFaces;
type faceSet;
action new;
source faceToFace;
sourceInfo
{
set lowerFaces;

}
}
{
name bufferstlFaces;
type faceSet;
action delete;
source faceToFace;
sourceInfo
{
set stlFaces;

}
}
);